{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "[BOS]": 5,
      "[EOS]": 6,
      "!": 7,
      "\"": 8,
      "#": 9,
      "$": 10,
      "%": 11,
      "&": 12,
      "'": 13,
      "(": 14,
      ")": 15,
      "*": 16,
      "+": 17,
      ",": 18,
      "-": 19,
      ".": 20,
      "/": 21,
      "0": 22,
      "1": 23,
      "2": 24,
      "3": 25,
      "4": 26,
      "5": 27,
      "6": 28,
      "7": 29,
      "8": 30,
      "9": 31,
      ":": 32,
      ";": 33,
      "=": 34,
      "?": 35,
      "A": 36,
      "B": 37,
      "C": 38,
      "D": 39,
      "E": 40,
      "F": 41,
      "G": 42,
      "H": 43,
      "I": 44,
      "J": 45,
      "K": 46,
      "L": 47,
      "M": 48,
      "N": 49,
      "O": 50,
      "P": 51,
      "Q": 52,
      "R": 53,
      "S": 54,
      "T": 55,
      "U": 56,
      "V": 57,
      "W": 58,
      "X": 59,
      "Y": 60,
      "Z": 61,
      "[": 62,
      "\\": 63,
      "]": 64,
      "_": 65,
      "a": 66,
      "b": 67,
      "c": 68,
      "d": 69,
      "e": 70,
      "f": 71,
      "g": 72,
      "h": 73,
      "i": 74,
      "j": 75,
      "k": 76,
      "l": 77,
      "m": 78,
      "n": 79,
      "o": 80,
      "p": 81,
      "q": 82,
      "r": 83,
      "s": 84,
      "t": 85,
      "u": 86,
      "v": 87,
      "w": 88,
      "x": 89,
      "y": 90,
      "z": 91,
      "Ċ": 92,
      "Ġ": 93,
      "OS": 94,
      "Ġt": 95,
      "Ġ[": 96,
      "Ġa": 97,
      "BOS": 98,
      "EOS": 99,
      "in": 100,
      "Ġth": 101,
      "re": 102,
      "Ġb": 103,
      "Ġw": 104,
      "Ġs": 105,
      "on": 106,
      "Ġi": 107,
      "ing": 108,
      "er": 109,
      "Ġthe": 110,
      "ll": 111,
      "Ġm": 112,
      "ou": 113,
      "Ġd": 114,
      "Ġc": 115,
      "Ġp": 116,
      "Ġto": 117,
      "Ġg": 118,
      "es": 119,
      "or": 120,
      "Ġl": 121,
      "nd": 122,
      "Ġf": 123,
      "at": 124,
      "ĠI": 125,
      "ke": 126,
      "Ġh": 127,
      "ar": 128,
      "Ġo": 129,
      "Ġbe": 130,
      "ay": 131,
      "en": 132,
      "it": 133,
      "Ġis": 134,
      "ed": 135,
      "is": 136,
      "an": 137,
      "ut": 138,
      "ow": 139,
      ".[": 140,
      "Ġn": 141,
      "om": 142,
      "st": 143,
      "Ġe": 144,
      "Ġin": 145,
      "Ġand": 146,
      "id": 147,
      "le": 148,
      "ĠT": 149,
      "Ġwe": 150,
      "ver": 151,
      "ck": 152,
      "Ġy": 153,
      "ot": 154,
      "Ġit": 155,
      "Ġu": 156,
      "et": 157,
      "as": 158,
      "Ġof": 159,
      "ld": 160,
      "Ġre": 161,
      "gh": 162,
      "ĠS": 163,
      "all": 164,
      "ly": 165,
      "ad": 166,
      "ic": 167,
      "ve": 168,
      "Ġgo": 169,
      "Ġlo": 170,
      "ĠTh": 171,
      "Ġyou": 172,
      "al": 173,
      "ion": 174,
      "Ġon": 175,
      "ill": 176,
      "se": 177,
      "Ġwh": 178,
      "Ġsh": 179,
      "Ġfor": 180,
      "Ġat": 181,
      "ike": 182,
      "um": 183,
      "ĠW": 184,
      "ĠN": 185,
      "Ġr": 186,
      "..": 187,
      "Ġthat": 188,
      "Ġbu": 189,
      "Ġst": 190,
      "ct": 191,
      "op": 192,
      "ĠF": 193,
      "?[": 194,
      "ĠD": 195,
      "ght": 196,
      "ĠA": 197,
      "ĠC": 198,
      "Ġare": 199,
      "Ġthis": 200,
      "ket": 201,
      "ĠB": 202,
      "Ġlike": 203,
      "own": 204,
      "Ġdo": 205,
      "am": 206,
      "day": 207,
      "ore": 208,
      "Ġput": 209,
      "ĠH": 210,
      "arket": 211,
      "ch": 212,
      "Ġse": 213,
      "ont": 214,
      "Ġ1": 215,
      "ĠM": 216,
      "Ġso": 217,
      "out": 218,
      "Ġputs": 219,
      "Ġj": 220,
      "Ġwill": 221,
      "ort": 222,
      "very": 223,
      "ĠL": 224,
      "ust": 225,
      "ĠG": 226,
      "Ġan": 227,
      "ould": 228,
      "Ġup": 229,
      "od": 230,
      "ent": 231,
      "ight": 232,
      "ra": 233,
      "Ġget": 234,
      "Ġfu": 235,
      "Ġha": 236,
      "ars": 237,
      "ally": 238,
      "ump": 239,
      "ce": 240,
      "Ġmarket": 241,
      "Ġtoday": 242,
      "Ġop": 243,
      "Ġne": 244,
      "Ġnot": 245,
      "Ġbuy": 246,
      "ain": 247,
      "ea": 248,
      "ere": 249,
      "ith": 250,
      "Ġwee": 251,
      "nt": 252,
      "Ġba": 253,
      "Ġbut": 254,
      "one": 255
    },
    "merges": [
      "O S",
      "Ġ t",
      "Ġ [",
      "Ġ a",
      "B OS",
      "E OS",
      "i n",
      "Ġt h",
      "r e",
      "Ġ b",
      "Ġ w",
      "Ġ s",
      "o n",
      "Ġ i",
      "in g",
      "e r",
      "Ġth e",
      "l l",
      "Ġ m",
      "o u",
      "Ġ d",
      "Ġ c",
      "Ġ p",
      "Ġt o",
      "Ġ g",
      "e s",
      "o r",
      "Ġ l",
      "n d",
      "Ġ f",
      "a t",
      "Ġ I",
      "k e",
      "Ġ h",
      "a r",
      "Ġ o",
      "Ġb e",
      "a y",
      "e n",
      "i t",
      "Ġi s",
      "e d",
      "i s",
      "a n",
      "u t",
      "o w",
      ". [",
      "Ġ n",
      "o m",
      "s t",
      "Ġ e",
      "Ġ in",
      "Ġa nd",
      "i d",
      "l e",
      "Ġ T",
      "Ġw e",
      "v er",
      "c k",
      "Ġ y",
      "o t",
      "Ġi t",
      "Ġ u",
      "e t",
      "a s",
      "Ġo f",
      "l d",
      "Ġ re",
      "g h",
      "Ġ S",
      "a ll",
      "l y",
      "a d",
      "i c",
      "v e",
      "Ġg o",
      "Ġl o",
      "ĠT h",
      "Ġy ou",
      "a l",
      "i on",
      "Ġ on",
      "i ll",
      "s e",
      "Ġw h",
      "Ġs h",
      "Ġf or",
      "Ġa t",
      "i ke",
      "u m",
      "Ġ W",
      "Ġ N",
      "Ġ r",
      ". .",
      "Ġth at",
      "Ġb u",
      "Ġs t",
      "c t",
      "o p",
      "Ġ F",
      "? [",
      "Ġ D",
      "gh t",
      "Ġ A",
      "Ġ C",
      "Ġa re",
      "Ġth is",
      "ke t",
      "Ġ B",
      "Ġl ike",
      "ow n",
      "Ġd o",
      "a m",
      "d ay",
      "o re",
      "Ġp ut",
      "Ġ H",
      "ar ket",
      "c h",
      "Ġs e",
      "on t",
      "Ġ 1",
      "Ġ M",
      "Ġs o",
      "ou t",
      "Ġput s",
      "Ġ j",
      "Ġw ill",
      "or t",
      "ver y",
      "Ġ L",
      "u st",
      "Ġ G",
      "Ġa n",
      "ou ld",
      "Ġu p",
      "o d",
      "en t",
      "i ght",
      "r a",
      "Ġg et",
      "Ġf u",
      "Ġh a",
      "ar s",
      "all y",
      "um p",
      "c e",
      "Ġm arket",
      "Ġto day",
      "Ġo p",
      "Ġn e",
      "Ġn ot",
      "Ġbu y",
      "a in",
      "e a",
      "e re",
      "it h",
      "Ġwe e",
      "n t",
      "Ġb a",
      "Ġb ut",
      "on e"
    ]
  }
}