{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "[BOS]": 5,
      "[EOS]": 6,
      "!": 7,
      "\"": 8,
      "#": 9,
      "$": 10,
      "%": 11,
      "&": 12,
      "'": 13,
      "(": 14,
      ")": 15,
      "*": 16,
      "+": 17,
      ",": 18,
      "-": 19,
      ".": 20,
      "/": 21,
      "0": 22,
      "1": 23,
      "2": 24,
      "3": 25,
      "4": 26,
      "5": 27,
      "6": 28,
      "7": 29,
      "8": 30,
      "9": 31,
      ":": 32,
      ";": 33,
      "=": 34,
      "?": 35,
      "@": 36,
      "A": 37,
      "B": 38,
      "C": 39,
      "D": 40,
      "E": 41,
      "F": 42,
      "G": 43,
      "H": 44,
      "I": 45,
      "J": 46,
      "K": 47,
      "L": 48,
      "M": 49,
      "N": 50,
      "O": 51,
      "P": 52,
      "Q": 53,
      "R": 54,
      "S": 55,
      "T": 56,
      "U": 57,
      "V": 58,
      "W": 59,
      "X": 60,
      "Y": 61,
      "Z": 62,
      "[": 63,
      "\\": 64,
      "]": 65,
      "^": 66,
      "_": 67,
      "`": 68,
      "a": 69,
      "b": 70,
      "c": 71,
      "d": 72,
      "e": 73,
      "f": 74,
      "g": 75,
      "h": 76,
      "i": 77,
      "j": 78,
      "k": 79,
      "l": 80,
      "m": 81,
      "n": 82,
      "o": 83,
      "p": 84,
      "q": 85,
      "r": 86,
      "s": 87,
      "t": 88,
      "u": 89,
      "v": 90,
      "w": 91,
      "x": 92,
      "y": 93,
      "z": 94,
      "{": 95,
      "|": 96,
      "}": 97,
      "~": 98,
      "ĉ": 99,
      "Ċ": 100,
      "č": 101,
      "ě": 102,
      "Ġ": 103,
      "OS": 104,
      "Ġt": 105,
      "Ġ[": 106,
      "EOS": 107,
      "BOS": 108,
      "in": 109,
      "Ġa": 110,
      "Ġth": 111,
      "Ġs": 112,
      "re": 113,
      "on": 114,
      "Ġb": 115,
      "Ġw": 116,
      "ou": 117,
      "ing": 118,
      "Ġm": 119,
      "Ġi": 120,
      "Ġthe": 121,
      "ll": 122,
      "er": 123,
      "ĠI": 124,
      "Ġd": 125,
      "Ġc": 126,
      "Ġf": 127,
      "Ġto": 128,
      "Ġh": 129,
      "or": 130,
      "Ġp": 131,
      "Ġg": 132,
      "at": 133,
      "en": 134,
      "Ġl": 135,
      "an": 136,
      "st": 137,
      "it": 138,
      "Ġan": 139,
      "ar": 140,
      "Ġo": 141,
      "ed": 142,
      "Ġy": 143,
      "ay": 144,
      "es": 145,
      "Ġn": 146,
      "ck": 147,
      "ĠT": 148,
      "et": 149,
      "ow": 150,
      "Ġin": 151,
      ".[": 152,
      "om": 153,
      "Ġit": 154,
      "is": 155,
      "Ġis": 156,
      "Ġand": 157,
      "Ġyou": 158,
      "Ġon": 159,
      "ot": 160,
      "Ġbe": 161,
      "ve": 162,
      "as": 163,
      "Ġbu": 164,
      "ĠA": 165,
      "all": 166,
      "ol": 167,
      "Ġe": 168,
      "Ġu": 169,
      "Ġof": 170,
      "ĠS": 171,
      "gh": 172,
      "Ġst": 173,
      "ĠB": 174,
      "Ġre": 175,
      "Ġfor": 176,
      "ee": 177,
      "le": 178,
      "ĠW": 179,
      "ad": 180,
      "Ġwh": 181,
      "Ġsh": 182,
      "ri": 183,
      "Ġgo": 184,
      "ke": 185,
      "ly": 186,
      "ĠG": 187,
      "ĠN": 188,
      "?[": 189,
      "ĠP": 190,
      "ver": 191,
      "al": 192,
      "se": 193,
      "..": 194,
      "ion": 195,
      "Ġ1": 196,
      "Ġthat": 197,
      "ch": 198,
      "ill": 199,
      "ght": 200,
      "ĠC": 201,
      "ĠTh": 202,
      "id": 203,
      "ĠM": 204,
      "ro": 205,
      "out": 206,
      "Ġthis": 207,
      "ce": 208,
      "me": 209,
      "ut": 210,
      "Ġat": 211,
      "Ġup": 212,
      "uck": 213,
      "ust": 214,
      "Ġha": 215,
      "Ġmy": 216,
      "oo": 217,
      "ld": 218,
      "Ġ$": 219,
      "Ġj": 220,
      "day": 221,
      "one": 222,
      "ĠF": 223,
      "Ġli": 224,
      "ell": 225,
      "ĠD": 226,
      "Ġmo": 227,
      "ent": 228,
      "Ġare": 229,
      "Ġne": 230,
      "Ġme": 231,
      "ct": 232,
      "ere": 233,
      "00": 234,
      "ĠH": 235,
      "Ġbuy": 236,
      "th": 237,
      "op": 238,
      "ĠL": 239,
      "Ġcall": 240,
      "Ġ2": 241,
      "mp": 242,
      "Ġdo": 243,
      "ith": 244,
      "ĠY": 245,
      "nt": 246,
      "old": 247,
      "ould": 248,
      "Ġjust": 249,
      "ir": 250,
      "ome": 251,
      "Ġbut": 252,
      "pp": 253,
      "Ġso": 254,
      "'s": 255
    },
    "merges": [
      "O S",
      "Ġ t",
      "Ġ [",
      "E OS",
      "B OS",
      "i n",
      "Ġ a",
      "Ġt h",
      "Ġ s",
      "r e",
      "o n",
      "Ġ b",
      "Ġ w",
      "o u",
      "in g",
      "Ġ m",
      "Ġ i",
      "Ġth e",
      "l l",
      "e r",
      "Ġ I",
      "Ġ d",
      "Ġ c",
      "Ġ f",
      "Ġt o",
      "Ġ h",
      "o r",
      "Ġ p",
      "Ġ g",
      "a t",
      "e n",
      "Ġ l",
      "a n",
      "s t",
      "i t",
      "Ġa n",
      "a r",
      "Ġ o",
      "e d",
      "Ġ y",
      "a y",
      "e s",
      "Ġ n",
      "c k",
      "Ġ T",
      "e t",
      "o w",
      "Ġ in",
      ". [",
      "o m",
      "Ġi t",
      "i s",
      "Ġi s",
      "Ġan d",
      "Ġy ou",
      "Ġ on",
      "o t",
      "Ġb e",
      "v e",
      "a s",
      "Ġb u",
      "Ġ A",
      "a ll",
      "o l",
      "Ġ e",
      "Ġ u",
      "Ġo f",
      "Ġ S",
      "g h",
      "Ġs t",
      "Ġ B",
      "Ġ re",
      "Ġf or",
      "e e",
      "l e",
      "Ġ W",
      "a d",
      "Ġw h",
      "Ġs h",
      "r i",
      "Ġg o",
      "k e",
      "l y",
      "Ġ G",
      "Ġ N",
      "? [",
      "Ġ P",
      "v er",
      "a l",
      "s e",
      ". .",
      "i on",
      "Ġ 1",
      "Ġth at",
      "c h",
      "i ll",
      "gh t",
      "Ġ C",
      "ĠT h",
      "i d",
      "Ġ M",
      "r o",
      "ou t",
      "Ġth is",
      "c e",
      "m e",
      "u t",
      "Ġa t",
      "Ġu p",
      "u ck",
      "u st",
      "Ġh a",
      "Ġm y",
      "o o",
      "l d",
      "Ġ $",
      "Ġ j",
      "d ay",
      "on e",
      "Ġ F",
      "Ġl i",
      "e ll",
      "Ġ D",
      "Ġm o",
      "en t",
      "Ġa re",
      "Ġn e",
      "Ġm e",
      "c t",
      "e re",
      "0 0",
      "Ġ H",
      "Ġbu y",
      "t h",
      "o p",
      "Ġ L",
      "Ġc all",
      "Ġ 2",
      "m p",
      "Ġd o",
      "it h",
      "Ġ Y",
      "n t",
      "ol d",
      "ou ld",
      "Ġj ust",
      "i r",
      "om e",
      "Ġbu t",
      "p p",
      "Ġs o",
      "' s"
    ]
  }
}